#include "nv.h"
#include "nv2.h"
#include "nv3.h"


//---------------------------------------------------------------------------
extern ST_NV Nv;


//---------------------------------------------------------------------------
///// ソース改変ここから /////
/*
void NvExprPush(bool is)
{
	_ASSERT(Nv.expr.cnt+1 < NV_MAX_EXPR_CNT);

	Nv.expr.isUse[Nv.expr.cnt++] = is;
}
*/
///// ソース改変ここまで /////
//---------------------------------------------------------------------------
///// ソース改変ここから /////
/*
void NvExprPop(void)
{
	_ASSERT(Nv.expr.cnt != 0);

	Nv.expr.cnt--;
}
*/
///// ソース改変ここまで /////
//---------------------------------------------------------------------------
///// ソース改変ここから /////
/*
void NvExprFlip(void)
{
	_ASSERT(Nv.expr.cnt != 0);

	Nv.expr.isUse[Nv.expr.cnt - 1] ^= 1;
}
*/
///// ソース改変ここまで /////
//---------------------------------------------------------------------------
///// ソース改変ここから /////
/*
bool NvIsExpr(void)
{
	s32 i;

	for(i=0; i<Nv.expr.cnt; i++)
	{
		if(Nv.expr.isUse[i] == false)
		{
			return false;
		}
	}

	return true;
}
*/
///// ソース改変ここまで /////
